import Vue from "vue";

const articlesContent = [
  {
  title: "Самое важное в SASS",
  date: "22 ноября 2016",
  content: "<p> Таким образом начало повседневной работы по формированию позиции позволяет выполнять важные задания по разработке направлений прогрессивного развития. Разнообразный и богатый опыт новая модель организационной деятельности играет важную роль в формировании новых предложений. Товарищи! новая модель организационной деятельности играет важную роль в формировании систем массового участия.	</p><p> Не следует, однако забывать, что укрепление и развитие структуры обеспечивает широкому кругу (специалистов) участие в формировании систем массового участия. Идейные соображения высшего порядка, а также рамки и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании позиций, занимаемых участниками в отношении поставленных задач. Товарищи! постоянный количественный рост и сфера нашей активности способствует подготовки и реализации модели развития. С другой стороны рамки и место обучения кадров влечет за собой процесс внедрения и модернизации системы обучения кадров, соответствует насущным потребностям.</p> <div class='article__snippet'><img class='article__snippet-img' alt='snippet' src='assets/images/blog/snippet.jpg'></div>"
 
 
},
	
  {
  title: "Приёмы в вёрстке, без которых не обходится ни один сайт",
  date: "13 ноября 2016",
  content: "<p> Таким образом начало повседневной работы по формированию позиции позволяет выполнять важные задания по разработке направлений прогрессивного развития. Разнообразный и богатый опыт новая модель организационной деятельности играет важную роль в формировании новых предложений. Товарищи! новая модель организационной деятельности играет важную роль в формировании систем массового участия.	</p><p> Не следует, однако забывать, что укрепление и развитие структуры обеспечивает широкому кругу (специалистов) участие в формировании систем массового участия. Идейные соображения высшего порядка, а также рамки и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании позиций, занимаемых участниками в отношении поставленных задач. Товарищи! постоянный количественный рост и сфера нашей активности способствует подготовки и реализации модели развития. С другой стороны рамки и место обучения кадров влечет за собой процесс внедрения и модернизации системы обучения кадров, соответствует насущным потребностям.</p>"

  
},

  {
  title: "Самый необходимый набор Gulp плагинов",
  date: "7 октября 2017",
  content: "<p> Таким образом начало повседневной работы по формированию позиции позволяет выполнять важные задания по разработке направлений прогрессивного развития. Разнообразный и богатый опыт новая модель организационной деятельности играет важную роль в формировании новых предложений. Товарищи! новая модель организационной деятельности играет важную роль в формировании систем массового участия.	</p><p> Не следует, однако забывать, что укрепление и развитие структуры обеспечивает широкому кругу (специалистов) участие в формировании систем массового участия. Идейные соображения высшего порядка, а также рамки и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании позиций, занимаемых участниками в отношении поставленных задач. Товарищи! постоянный количественный рост и сфера нашей активности способствует подготовки и реализации модели развития. С другой стороны рамки и место обучения кадров влечет за собой процесс внедрения и модернизации системы обучения кадров, соответствует насущным потребностям.</p>"
 
},

  {
  title: "Почему я выбрал Jade",
  date: "18 мая 2018",
  content: "<p> Таким образом начало повседневной работы по формированию позиции позволяет выполнять важные задания по разработке направлений прогрессивного развития. Разнообразный и богатый опыт новая модель организационной деятельности играет важную роль в формировании новых предложений. Товарищи! новая модель организационной деятельности играет важную роль в формировании систем массового участия.	</p><p> Не следует, однако забывать, что укрепление и развитие структуры обеспечивает широкому кругу (специалистов) участие в формировании систем массового участия. Идейные соображения высшего порядка, а также рамки и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании позиций, занимаемых участниками в отношении поставленных задач. Товарищи! постоянный количественный рост и сфера нашей активности способствует подготовки и реализации модели развития. С другой стороны рамки и место обучения кадров влечет за собой процесс внедрения и модернизации системы обучения кадров, соответствует насущным потребностям.</p>"
},

  {
  title: "Ограничение длины текста через градиент",
  date: "10 июня 2018",
  content: "<p> Таким образом начало повседневной работы по формированию позиции позволяет выполнять важные задания по разработке направлений прогрессивного развития. Разнообразный и богатый опыт новая модель организационной деятельности играет важную роль в формировании новых предложений. Товарищи! новая модель организационной деятельности играет важную роль в формировании систем массового участия.	</p><p> Не следует, однако забывать, что укрепление и развитие структуры обеспечивает широкому кругу (специалистов) участие в формировании систем массового участия. Идейные соображения высшего порядка, а также рамки и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании позиций, занимаемых участниками в отношении поставленных задач. Товарищи! постоянный количественный рост и сфера нашей активности способствует подготовки и реализации модели развития. С другой стороны рамки и место обучения кадров влечет за собой процесс внедрения и модернизации системы обучения кадров, соответствует насущным потребностям.</p>"

}	
];



const blogArticlesContent = {
  template: "#blog-articles-content",

  props: {
    blogItem: Object 
  } 
	


};



const blogTitles = {
  template: "#blog-titles",
 
  props: {
    blogItem: Object,
    blogArticlesContent: Object
  }
 
};

new Vue({
  el: "#blog",
  components: {
	blogTitles,
	blogArticlesContent  
  },
  data: {
    blogContent: {}
  },
  created() {
	  this.blogContent = articlesContent;
	  
  },
	
  template: "#blog-section",
	
  methods: {
  
	 openAside() {
	   const asideBlock = this.$refs["aside-block"];
	 
	   asideBlock.classList.toggle("titlesarticles_active");
	 
	 },
	  
   findTop() {
	 const asideTitle = this.$refs["aside-title"];
	 const articleSection = this.$refs["article-section"]; 
	 
	 window.addEventListener("scroll", function() { 
	
     const sectionTop = articleSection.getBoundingClientRect().top;
     
	 
     if (sectionTop < 50 && screen.width > 1010 ) {
		
	 asideTitle.style.position = "fixed";
		asideTitle.style.top = 75  + "px"; 


	 }
		 
     else if (sectionTop > 51 && screen.width > 1010) {
		 asideTitle.style.position = "absolute";

	 }
		 
     else if (sectionTop < 50 && screen.width < 1010) {
		 asideTitle.style.top = 50 + "px";
		
	 }
	   });
   }
  },
		 
  
  mounted() {
    this.findTop()
 
  }
});


function drawTitle()  {
	const articleTitle = document.getElementsByClassName("js-article-title");
	const articleItem = document.getElementsByClassName("js-article");
	
	 window.addEventListener("scroll", function() { 
		for(let i = 0; i < articleTitle.length; i++ ) {
        let posArticleTop = articleItem[i].getBoundingClientRect().top;
		let exactArticleTop = posArticleTop.toFixed();
		 
		
        if (exactArticleTop < 345	 && exactArticleTop > -50  ) {
         articleTitle[i].classList.add("aricles-titles__item_active");
        }
		else {
		 articleTitle[i].classList.remove("aricles-titles__item_active");	
		}	
		}
      });
};

if (document.getElementsByClassName("js-article-title").length > 0) {
	drawTitle(); 
	}