//import Vue from "vue";
//
//const articlesContent = [
//  {
//  title: "Самое важное в SASS",
//  date: "22 ноября 2016",
//  content: "<p> Таким образом начало повседневной работы по формированию позиции позволяет выполнять важные задания по разработке направлений прогрессивного развития. Разнообразный и богатый опыт новая модель организационной деятельности играет важную роль в формировании новых предложений. Товарищи! новая модель организационной деятельности играет важную роль в формировании систем массового участия.	</p><p> Не следует, однако забывать, что укрепление и развитие структуры обеспечивает широкому кругу (специалистов) участие в формировании систем массового участия. Идейные соображения высшего порядка, а также рамки и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании позиций, занимаемых участниками в отношении поставленных задач. Товарищи! постоянный количественный рост и сфера нашей активности способствует подготовки и реализации модели развития. С другой стороны рамки и место обучения кадров влечет за собой процесс внедрения и модернизации системы обучения кадров, соответствует насущным потребностям.</p>",
//  image: "assets/images/blog/snippet.jpg"
//},
//	
//  {
//  title: "Приёмы в вёрстке, без которых не обходится ни один сайт",
//  date: "13 ноября 2016",
//  content: "<p> Таким образом начало повседневной работы по формированию позиции позволяет выполнять важные задания по разработке направлений прогрессивного развития. Разнообразный и богатый опыт новая модель организационной деятельности играет важную роль в формировании новых предложений. Товарищи! новая модель организационной деятельности играет важную роль в формировании систем массового участия.	</p><p> Не следует, однако забывать, что укрепление и развитие структуры обеспечивает широкому кругу (специалистов) участие в формировании систем массового участия. Идейные соображения высшего порядка, а также рамки и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании позиций, занимаемых участниками в отношении поставленных задач. Товарищи! постоянный количественный рост и сфера нашей активности способствует подготовки и реализации модели развития. С другой стороны рамки и место обучения кадров влечет за собой процесс внедрения и модернизации системы обучения кадров, соответствует насущным потребностям.</p>",
//  image: " "
//},
//
//  {
//  title: "Самый необходимый набор Gulp плагинов",
//  date: "7 октября 2017",
//  content: "<p> Таким образом начало повседневной работы по формированию позиции позволяет выполнять важные задания по разработке направлений прогрессивного развития. Разнообразный и богатый опыт новая модель организационной деятельности играет важную роль в формировании новых предложений. Товарищи! новая модель организационной деятельности играет важную роль в формировании систем массового участия.	</p><p> Не следует, однако забывать, что укрепление и развитие структуры обеспечивает широкому кругу (специалистов) участие в формировании систем массового участия. Идейные соображения высшего порядка, а также рамки и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании позиций, занимаемых участниками в отношении поставленных задач. Товарищи! постоянный количественный рост и сфера нашей активности способствует подготовки и реализации модели развития. С другой стороны рамки и место обучения кадров влечет за собой процесс внедрения и модернизации системы обучения кадров, соответствует насущным потребностям.</p>",
//},
//
//  {
//  title: "Почему я выбрал Jade",
//  date: "18 мая 2018",
//  content: "<p> Таким образом начало повседневной работы по формированию позиции позволяет выполнять важные задания по разработке направлений прогрессивного развития. Разнообразный и богатый опыт новая модель организационной деятельности играет важную роль в формировании новых предложений. Товарищи! новая модель организационной деятельности играет важную роль в формировании систем массового участия.	</p><p> Не следует, однако забывать, что укрепление и развитие структуры обеспечивает широкому кругу (специалистов) участие в формировании систем массового участия. Идейные соображения высшего порядка, а также рамки и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании позиций, занимаемых участниками в отношении поставленных задач. Товарищи! постоянный количественный рост и сфера нашей активности способствует подготовки и реализации модели развития. С другой стороны рамки и место обучения кадров влечет за собой процесс внедрения и модернизации системы обучения кадров, соответствует насущным потребностям.</p>",
//  image: " "
//},
//
//  {
//  title: "Ограничение длины текста через градиент",
//  date: "10 июня 2018",
//  content: "<p> Таким образом начало повседневной работы по формированию позиции позволяет выполнять важные задания по разработке направлений прогрессивного развития. Разнообразный и богатый опыт новая модель организационной деятельности играет важную роль в формировании новых предложений. Товарищи! новая модель организационной деятельности играет важную роль в формировании систем массового участия.	</p><p> Не следует, однако забывать, что укрепление и развитие структуры обеспечивает широкому кругу (специалистов) участие в формировании систем массового участия. Идейные соображения высшего порядка, а также рамки и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании позиций, занимаемых участниками в отношении поставленных задач. Товарищи! постоянный количественный рост и сфера нашей активности способствует подготовки и реализации модели развития. С другой стороны рамки и место обучения кадров влечет за собой процесс внедрения и модернизации системы обучения кадров, соответствует насущным потребностям.</p>",
//  image: " "
//}	
//];
//
//const asideTitle = document.getElementsByClassName(".js-aside-title");
//const articleTitle = document.getElementsByClassName(".js-article-title");
//const articleData = document.getElementsByClassName(".js-article-data");
//const articleText = document.getElementsByClassName(".js-article-text");
//const articleItem = document.getElementsByClassName(".js-articles-item");
//const articleImg = document.querySelector(".js-article-image");
//
//
//function blog() {
//  console.log(articlesContent.length);	
//  for (let i = 0; i < articlesContent.length; i++) {
//	asideTitle[i].innerText = articlesContent[i].title;
//	articleTitle[i].innerText = articlesContent[i].title;
//	articleData[i].innerText = articlesContent[i].date;
//	articleText[i].innerHTML = articlesContent[i].content;
//	articleImg[i].setAttribute("src", articlesContent[i].image);  
//  }
//};
//
//blog();
//
////const blogArticlesContent = {
////  template: "#blog-articles-content",
////  components: {
////  
////  },
////  props: {
////    
////  }
////};
////
////const blogArticles = {
////  template: "#blog-articles",
////  components: {
////    blogArticlesContent
////  },
////  props: {
////    blogItem: Object
////  }
////};
////
////const blogTitles = {
////  template: "#blog-titles",
//// 
////  props: {
////    blogItem: Object
////  }
////};
////
////new Vue({
////  el: "#maincontent-blog",
////  components: {
////	blogTitles,
////	blogArticles  
////  },
////  data: {
////    blogContent: {}
////  },
////  created() {
////	  this.blogContent = articlesContent;
////	  
////  },
////	
////  template: "#blog-section"
////});
//
// 